Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Running `dcommit` on a branch with merged history works fine, except that when you look at your Git project history, it hasn’t rewritten either of the commits you made on the `experiment` branch — instead, all those changes appear in the SVN version of the single merge commit.
cs: Příkaz `dcommit` na větvi se začleněnou historií bude fungovat bez problémů, pomineme-li, že při pohledu na historii projektu Git zjistíme, že nepřepsal žádnou z revizí, kterou jste provedli ve větvi `experiment`. Všechny změny se místo toho objeví v SVN verzi jedné revize vzniklé sloučením.

source: Running `git commit` checksums all project directories and stores them as `tree` objects in the Git repository.
cs: Vytvoříte-li revizi příkazem `git commit`, provede Git kontrolní součet každého adresáře (v tomto případě pouze kořenového adresáře projektu) a uloží tyto objekty stromu v repozitáři Git.

source: Running `git pull` generally fetches data from the server you originally cloned from and automatically tries to merge it into the code you’re currently working on.
cs: Příkaz `git pull` většinou vyzvedne data ze serveru, z něhož jste původně klonovali, a automaticky se pokusí začlenit je do kódu, na němž právě pracujete.

source: Running `git show HEAD@{2.months.ago}` will work only if you cloned the project at least two months ago — if you cloned it five minutes ago, you’ll get no results.
cs: Příkaz `git show HEAD@{2.months.ago}` bude fungovat, pouze pokud jste projekt naklonovali minimálně před dvěma měsíci (tedy „2 months ago“). Pokud jste jej naklonovali před pěti minutami, neobdržíte žádný výsledek.

source: Running `git svn rebase` every once in a while makes sure your code is always up to date.
cs: Spustíte-li čas od času příkaz `git svn rebase`, budete mít jistotu, že pracujete s aktuálním kódem.

source: Running a Git server is simple.
cs: Zprovoznění gitového serveru je jednoduché.

source: Running the handful of required commands gives you a simple way to give the world read access to your Git repository.
cs: Vystačíte s několika málo příkazy, ale získáte jednoduchý způsob, jak nastavit oprávnění pro čtení repozitáře Git pro okolní svět.

source: Running this command gives you a list of commits in your text editor that looks something like this:
cs: Spuštěním tohoto příkazu otevřete textový editor se seznamem revizí zhruba v této podobě:

source: Running your own server gives you a lot of control and allows you to run the server within your own firewall, but such a server generally requires a fair amount of your time to set up and maintain.
cs: Provoz vlastního serveru vám dává celou řadu možností kontroly a umožňuje provozovat server za vaším firewallem. Nastavení a správa takového serveru však obvykle bývají časově náročné.

source: SSH is also an authenticated network protocol; and because it’s ubiquitous, it’s generally easy to set up and use.
cs: SSH je také síťovým protokolem s autentizací, a protože je hojně rozšířen, je jeho nastavení a používání většinou snadné.

source: SSH is also the only network-based protocol that you can easily read from and write to.
cs: SSH je navíc jediným síťovým protokolem, z nějž lze snadno číst a do nějž lze snadno zapisovat.

source: SVN- or CVS-style keyword expansion is often requested by developers used to those systems.
cs: Vývojáři, kteří jsou zvyklí na jiné systémy, mohou požadovat nahrazení klíčového slova pro SVN nebo CVS.

source: Say you have a database settings file called database.xml that is different in two branches, and you want to merge in your other branch without messing up the database file.
cs: Řekněme, že máte soubor s nastavením databáze nazvaný database.xml, který se ve dvou větvích liší, a vy sem chcete začlenit jinou svoji větev, aniž byste tento soubor změnili.

source: Say you have your repositories in the `/opt/git` directory, and an Apache server is running on your machine.
cs: Řekněme, že máte repozitáře uloženy v adresáři `/opt/git` a na vašem počítači je spuštěn server Apache.

source: Say you want to use vimdiff:
cs: Řekněme, že jste se rozhodli používat vimdiff:

source: Second, SSH is relatively easy to set up — SSH daemons are commonplace, many network admins have experience with them, and many OS distributions are set up with them or have tools to manage them.
cs: Zadruhé: protokol SSH se snadno nastavuje – SSH démoni jsou zcela běžní, správci sítě si s nimi většinou vědí rady a mnoho distribucí OS je má ve výchozí instalaci nebo poskytuje nástroje pro jejich správu.

source: Second, it only shows you commits that have been committed up to the Subversion server.
cs: Zadruhé pak to, že zobrazuje pouze revize, jež byly zapsány na server Subversion.

source: See _Chapter 3_ for more detailed information on how to push to remote servers.
cs: Více informací o odesílání na vzdálené servery najdete v _kapitole 3_.

source: See Chapter 9 for a more detailed discussion of Git refspecs and different things you can do with them.
cs: Více o vzorcích refspec systému Git a různých možnostech, k nimž je lze využít, najdete v kapitole 9.

source: See the [BFG](http://rtyley.github.io/bfg-repo-cleaner/) website for details.
cs: Podrobnosti naleznete na stránkách [BFG](http://rtyley.github.io/bfg-repo-cleaner/).

source: See the `git config` manpage for all the subsettings you can configure, if you want to do that.
cs: Chcete-li použít dílčí nastavení, podrobnější informace naleznete na manuálové stránce `git config`.

source: Set up a merge wrapper script named `extMerge` that calls your binary with all the arguments provided:
cs: Nastavte wrapperový skript pro slučování `extMerge`, který bude volat binární soubor všemi dostupnými parametry:

source: Set your key ID like so:
cs: ID svého klíče nastavíte takto:

source: Setting up a `.gitignore` file before you get going is generally a good idea so you don’t accidentally commit files that you really don’t want in your Git repository.
cs: Vytvoření a naplnění souboru `.gitignore` ještě dříve než se pustíte do práce bývá většinou dobrý nápad. Alespoň se vám nestane, že byste nedopatřením zapsali také soubory, o které v repozitáři Git nestojíte.

source: She can do so by specifying the local branch followed by a colon (:) followed by the remote branch to the `git push` command:
cs: Může tak učinit příkazem `git push` s určením lokální větve, za níž bude následovat dvojtečka (:) a za ní vzdálená větev:

source: She can merge either `origin/master` or `issue54` first — they’re both upstream, so the order doesn’t matter.
cs: Jako první může začlenit buď větev `origin/master` nebo `issue54`. Obě jsou z linie předchozích revizí referenčního zdroje (upstream), a tak jejich pořadí nehraje žádnou roli.

source: She can then fetch Josie’s changes down with `git fetch`:
cs: Změny, které Josie provedla, vyzvedne příkazem `git fetch`:

source: She chooses to merge in `issue54` first:
cs: Jessica se rozhodne začlenit jako první větev `issue54`:

source: She creates a new branch for the feature and does some work on it there:
cs: Vytvoří si pro něj novou větev a udělá v ní určité penzum práce.

source: She hasn’t fetched John’s changes yet, so her commit history looks like Figure 5-7.
cs: Zatím ještě nevyzvedla Johnovy změny, a proto její historie revizí vypadá jako na obrázku 5-7.

source: She runs `git log` to find out:
cs: Spustí proto příkaz `git log`:

source: She runs a `git fetch` to pull down those changes:
cs: Jessica spustí příkaz `git fetch`, jímž tyto změny stáhne.

source: She’s created a topic branch called `issue54` and done three commits on that branch.
cs: Vytvořila tematickou větev s názvem `issue54` a zapsala do ní tři revize.

source: She’s ready to push up her work, but gets an e-mail from Josie that a branch with some initial work on it was already pushed to the server as `featureBee`.
cs: Jessica je připravena odeslat svou práci, ale dostane e-mail od Josie, že již na server odeslala větev `featureBee`, v níž už je část práce hotová.

source: Short (50 chars or less) summary of changes
cs: Krátké (do 50 znaků) shrnutí změn

source: Side note: There are different kinds of binary formats with a text content, which are hard to find usable converter for.
cs: Poznámka: Existují různé druhy binárních formátů, které obsahují text, a pro které se dají obtížně najít použitelné konvertory.

source: Simple version of the Git data model.
cs: Zjednodušený model dat v systému Git

source: Simply download the installer exe file from the GitHub page, and run it:
cs: Ze stránky GitHub stáhněte instalační soubor exe a spusťte ho:

source: Simply set it to the path of a file that has content similar to what a `.gitignore` file would have.
cs: Jednoduše nastavte cestu k souboru s obsahem podobným souboru `.gitignore`.

source: Simply set up a single repository, and give everyone on your team push access; Git won’t let users overwrite each other.
cs: Jednoduše vytvořte repozitář a přidělte všem ze svého týmu oprávnění k odesílání dat. Git neumožní uživatelům, aby se navzájem přepisovali.

source: Simply stage and commit files until you have several commits, and run `git rebase --continue` when you’re done:
cs: Zkrátka postupně soubory připravíte a zapíšete, čímž vznikne několik zápisů. Jakmile s tím budete hotovi, zadejte příkaz `git rebase --continue`:

source: Since its birth in 2005, Git has evolved and matured to be easy to use and yet retain these initial qualities.
cs: Od svého vzniku v roce 2005 se Git vyvinul a vyzrál v snadno použitelný systém, který si dodnes uchovává své prvotní kvality.

source: Since you have no code there yet, GitHub will show you instructions for how create a brand-new project, push an existing Git project up, or import a project from a public Subversion repository (see Figure 4-7).
cs: Protože v něm ještě nemáte uložen žádný kód, GitHub vám nabízí instrukce, jak vytvořit zcela nový projekt, odeslat sem existující projekt Git nebo naimportovat projekt z veřejného repozitáře Subversion (viz obrázek 4-7).

source: Single commit repository data.
cs: Repozitář s daty jedné revize

source: So far, I’ve covered the basics of how Git works and how to use it, and I’ve introduced a number of tools that Git provides to help you use it easily and efficiently.
cs: Do této chvíle jsem se věnoval základům práce v systému Git a tomu, jak systém používat. Představil jsem několik nástrojů, které Git nabízí pro usnadnění a zefektivnění práce.

source: So far, we’ve only seen permissions to be one of `R`, `RW`, or `RW+`.
cs: Prozatím jsme si ukázali jen oprávnění nastavená na jednu z hodnot `R`, `RW` nebo `RW+`.

source: So we call it a "refex"!
cs: Nazvěme jej tedy „refex“!

source: So, `git fetch origin` fetches any new work that has been pushed to that server since you cloned (or last fetched from) it.
cs: Takže příkaz `git fetch origin` vyzvedne veškerou novou práci, která byla na uvedený server poslána (push) od okamžiku, kdy jste odtud klonovali (nebo kdy jste odtud naposledy vyzvedávali práci).

source: So, if the Rack project updates, you can pull in upstream changes by switching to that branch and pulling:
cs: Pokud je proto projekt Rack aktualizován, můžete natáhnout novější změny přepnutím na tuto větev a jejím natažením:

source: So, if there is a `master` branch on the server, you can access the log of that branch locally via
cs: Je-li tedy na serveru hlavní větev `master`, lokálně lze získat přístup k jejímu logu některým z příkazů:

source: So, if you see that a method in your code is buggy, you can annotate the file with `git blame` to see when each line of the method was last edited and by whom.
cs: Pokud zjistíte, že některá metoda ve vašem kódu obsahuje chybu, můžete soubor anotovat příkazem `git blame`, který u každého řádku metody zobrazí, kdo a kdy ho naposledy upravil.

source: So, if you send in a patch to a project and one of the core members applies the patch, both of you get credit — you as the author and the core member as the committer.
cs: Pokud tedy pošlete záplatu k projektu a některý z ústředních členů (core members) ji použije, do výpisu se dostanete oba – vy jako autor a core member jako autor revize.

source: So, if you want to make a single commit from these three commits, you make the script look like this:
cs: Chcete-li tedy vytvořit jedinou revizi z těchto tří revizí, bude skript vypadat takto:

source: So, in the following file
cs: Do souboru

source: So, let’s change this line in your `/etc/passwd` file
cs: Takže v souboru `/etc/passwd` změňte následující řádek

source: So, let’s do an actual Git command — you’ll clone the Gitosis control repository:
cs: Provedeme tedy skutečný příkaz systému Git a naklonujeme řídicí repozitář Gitosis:

source: So, let’s use that advice to unstage the `benchmarks.rb` file:
cs: Budeme se tedy řídit touto radou a vrátíme soubor `benchmarks.rb` z oblasti připravených změn:

source: So, the first thing to do in your `print_export` method is generate a mark from the directory name:
cs: Prvním krokem, který tak při metodě se souborem `print_export` uděláte, bude vygenerování označovače na základě názvu adresáře:

source: So, these are scripts to help developers, and they must be set up and maintained by them, although they can be overridden or modified by them at any time.
cs: Toto jsou tedy skripty, které slouží jako pomůcka pro vývojáře. Uživatel je musí nastavit a spravovat, ale kdykoli je může také potlačit nebo upravit.

source: So, to create a tree object, you first have to set up an index by staging some files.
cs: Proto chcete-li vytvořit objekt stromu, musíte ze všeho nejdříve připravit soubory k zapsání, a vytvořit tak index.

source: So, to get a list of all the commit SHAs introduced between one commit SHA and another, you can run something like this:
cs: Pokud tedy chcete získat seznam všech hodnot SHA revizí provedených mezi dvěma konkrétními revizemi, můžete spustit zhruba toto:

source: So, what is Git in a nutshell?
cs: Jak bychom tedy mohli Git charakterizovat?

source: So, you can either run four config commands
cs: Můžete tedy spustit kterýkoli ze čtyř konfiguračních příkazů:

source: Some Linux distributions have a `gitweb` package that you may be able to install via `apt` or `yum`, so you may want to try that first.
cs: Některé linuxové distribuce mají balíček `gitweb`, který by mělo být možné nainstalovat pomocí nástrojů `apt` nebo `yum`. Zkuste proto tuto možnost jako první.

source: Some changes can be made simply by editing the rc file, but if that is not sufficient, there’s documentation on customising Gitolite.
cs: Něco můžete změnit jednoduše editací rc souboru. Pokud to ale nestačí, naleznete víc v dokumentaci věnované přizpůsobení Gitolite.

source: Some files look like text files but for all intents and purposes are to be treated as binary data.
cs: Některé soubory se tváří jako textové, ale v podstatě je s nimi třeba zacházet jako s binárními daty.

source: Some larger projects also have a `proposed` or `pu` (proposed updates) branch that has integrated branches that may not be ready to go into the `next` or `master` branch.
cs: Některé větší projekty mají také větev `proposed` nebo `pu` (proposed updates, návrh aktualizací) s integrovanými větvemi, které nemusí být nutně způsobilé k začlenění do větve `next` nebo `master`.

source: Some of the goals of the new system were as follows:
cs: Mezi požadované vlastnosti systému patřily zejména:

source: Some of the variables involved are active contributor size, chosen workflow, your commit access, and possibly the external contribution method.
cs: Mezi proměnné patří v tomto procesu počet aktivních přispěvatelů, zvolený pracovní postup, vaše oprávnění pro odesílání revizí a případně i metoda externího přispívání.

source: Some of these files may use an UTF-16 encoding or other "codepages" and `strings` won’t find anything useful in there.
cs: Některé z těchto souborů ale mohou používat kódování UTF-16 nebo jiné kódování a `strings` v nich nic rozumného nenajde.

source: Some of these settings can also be specified for a path, so that Git applies those settings only for a subdirectory or subset of files.
cs: Některá z těchto nastavení lze také provést pouze pro určité umístění, a Git je tak aplikuje pouze na jeden podadresář nebo skupinu souborů.

source: Some people have full access, and others only have access to push changes to certain subdirectories or specific files.
cs: Někteří uživatelé budou mít plný přístup, jiní budou mít přístup jen do některých podadresářů nebo ke konkrétním souborům.

source: Some people refer to the branching model in Git as its “killer feature” , and it certainly sets Git apart in the VCS community.
cs: Někteří lidé mluví o modelu větvení v systému Git jako o převratné vlastnosti. Není sporu o tom, že je Git díky tomu ve skupině systémů pro správu verzí poměrně jedinečný.

source: Someone accidentally commits a huge binary file with a thoughtless `git add .`, and you want to remove it everywhere.
cs: Někdo příkazem `git add .` bezmyšlenkovitě zapsal obří binární soubor a vy ho chcete odstranit ze všech revizí.

source: Someone pushes rebased commits, abandoning commits you’ve based your work on.
cs: Kdosi odeslal přeskládané revize a zahodil ty, na nichž jste založili svou práci.

source: Sometimes it's easier to review changes on the word level rather than on the line level.
cs: Někdy se změny kontrolují snadněji na úrovni slov než na úrovni řádků.

source: Sometimes you’re stuck on a project using another VCS, and many times that system is Subversion.
cs: Někdy jste nuceni pracovat na projektu v jiném systému VCS, jímž často bývá Subversion.

source: Sometimes, developers want to get a combination of a large project’s subdirectories, depending on what team they’re on.
cs: Vývojáři někdy chtějí získat kombinaci podadresářů velkého projektu podle toho, v jakém týmu pracují.

source: Splitting a commit undoes a commit and then partially stages and commits as many times as commits you want to end up with.
cs: Rozdělení revize vrátí všechny změny v revizi obsažené a po částech je znovu připraví a zapíše do tolika revizí, kolik určíte jako konečný počet.

source: Staged means that you have marked a modified file in its current version to go into your next commit snapshot.
cs: Připraveno k zapsání znamená, že jste změněný soubor v jeho aktuální verzi určili k tomu, aby byl zapsán v další revizi (tzv. commit).

source: Staging the file marks it as resolved in Git.
cs: Připravení souboru k zápisu ho v systému Git označí jako vyřešený.

source: Staging the files checksums each one (the SHA-1 hash we mentioned in Chapter 1), stores that version of the file in the Git repository (Git refers to them as blobs), and adds that checksum to the staging area:
cs: Při přípravě souborů k zapsání je pro každý z nich vypočítán kontrolní součet (o otisku SHA-1 jsme se zmínili v kapitole 1), daná verze souborů se uloží v repozitáři Git (Git na ně odkazuje jako na bloby) a přidá jejich kontrolní součet do oblasti připravených změn:

source: Start by clicking the "create a new one" link next to Your Repositories on the user dashboard.
cs: Začněte kliknutím na odkaz „create a new one“ (vytvořit nový) vedle nadpisu „Your Repositories“ na ovládacím panelu.

source: Start with the first tree you wrote:
cs: Začněte prvním stromem, který jste zapsali:

source: Stashing takes the dirty state of your working directory — that is, your modified tracked files and staged changes — and saves it on a stack of unfinished changes that you can reapply at any time.
cs: Odložení vezme neuspořádaný stav vašeho pracovního adresáře – tj. změněné sledované soubory a změny připravené k zapsání – a uloží ho do zásobníku nehotových změn, který můžete kdykoli znovu aplikovat.

source: Submodules allow you to keep a Git repository as a subdirectory of another Git repository.
cs: Submoduly umožňují uchovávat repozitář Git jako podadresář jiného repozitáře Git.

source: Subversion can have only a single linear history, and confusing it is very easy.
cs: Subversion může mít pouze jednu lineární historii a opravdu není těžké uvést ho do rozpaků.

source: Subversion has to clone one revision at a time and then push it back into another repository — it’s ridiculously inefficient, but it’s the only easy way to do this.
cs: Subversion musí klonovat každou revizi zvlášť a tu pak odesílá zpět do jiného repozitáře. Tento postup je sice velice neefektivní, ale jiná jednoduchá možnost neexistuje.

source: Subversion importing interface.
cs: Rozhraní importu ze systému Subversion

source: Suffice it to say that this is rare.
cs: Je jasné, že to většinou nechcete.

source: Suppose you add a remote like this:
cs: Řekněme, že přidáte například tento vzdálený repozitář:

source: Suppose you clone from a central server and then do some work off that.
cs: Představme si situaci, kdy jste naklonovali repozitář z centrálního serveru a provedli jste v něm několik změn.

source: Suppose you decide that you want to merge your client-side changes into your mainline for a release, but you want to hold off on the server-side changes until it’s tested further.
cs: Předpokládejme, že nyní chcete začlenit změny provedené na straně klienta do své hlavní linie k vydání, ale prozatím chcete počkat se změnami na straně serveru, dokud nebudou pečlivě otestovány.

source: Suppose you look at the history of your project:
cs: Můžete mít například takovouto historii projektu:

source: Suppose you want to add a mechanism that uses an access control list (ACL) that specifies which users are allowed to push changes to which parts of your projects.
cs: Předpokládejme, že chcete přidat mechanismus, který bude používat seznam oprávnění ACL (access control list), v němž bude stanoveno, kteří uživatelé smějí do které části vašeho projektu odesílat změny.

source: Suppose you want to add the Rack library (a Ruby web server gateway interface) to your project, possibly maintain your own changes to it, but continue to merge in upstream changes.
cs: Předpokládejme, že budete chtít vložit do svého projektu knihovnu Rack (rozhraní brány webového serveru Ruby), udržovat v ní vlastní změny, ale nadále začleňovat i změny ze serveru.

source: Suppose you work in current, you back up your project by occasionally copying the directory into a time-stamped `back_YYYY_MM_DD` backup directory, and you want to import this into Git.
cs: Řekněme, že pracujete na projektu, který příležitostně zálohujete zkopírováním pracovního adresáře do zálohového, datem označeného adresáře `back_YYYY_MM_DD`, a ten chcete nyní importovat do systému Git.

source: Suppose your commit history looks like this:
cs: Předpokládejme, že vaše historie revizí vypadá takto:

source: Suppose your history looks like the following: you created an `experiment` branch, did two commits, and then merged them back into `master`.
cs: Předpokládejme, že vaše historie vypadá následovně: vytvořili jste větev `experiment`, zapsali jste dvě revize a začlenili jste je zpět do větve `master`.

source: Suppose your repository contains the following branches and tags:
cs: Řekněme, že váš repozitář obsahuje tyto větve a značky:

source: Suppose you’re developing a web site and creating Atom feeds.
cs: Programujete webové stránky a vytváříte kanály Atom.

source: Suppose you’re done with a remote branch — say, you and your collaborators are finished with a feature and have merged it into your remote’s `master` branch (or whatever branch your stable codeline is in).
cs: Předpokládejme, že už nepotřebujete jednu ze vzdálených větví. Spolu se svými spolupracovníky jste dokončili určitou funkci a začlenili jste ji do větve `master` na vzdáleném serveru (nebo do jakékoli jiné větve, kterou používáte pro stabilní kód).
